"use client";

import {
	PageHeader,
} from "@/components";

export default function PisaninaPage() {
	return (
		<div className="min-h-screen flex justify-center px-8 md:px-16 lg:px-32 xl:px-48 2xl:px-64 py-16">
			<div className="max-w-md w-full">
				<PageHeader
					title="Писанина"
				/>

				<p>Наша школа</p>
				<p>Наша школа - это маленькая страна. <br /> Здесь временами обнаруживают пустые карманы. <br /> Кто-то крысит, а кто-то за это смеётся. <br /> Обкраденный потом пол-жизни трясётся. <br /> <br /> Классы, словно городки. <br /> Какие-то дружные, а где-то мэрия взбесилась. <br /> А по углам все винят тех, кто лают. <br /> Хотя лающие и в правду ничего не делают. <br /> <br /> В нашей школе можно выпить джина по ночам. <br /> С таким же страхом вводят новые законы. <br /> Бумаги не хватает даже на кучу копиров. <br /> Со второго этажа нужен парадный выход. <br /> <br /> Учителя, рождённые в рубашке, <br /> Поздно осознали, что остались без штанов. <br /> Некоторые ещё собираются по углам шептаться, <br /> Но большинство привыкли ни за что не браться. <br /> <br /> В стране плохие дороги - у нас сортиры. <br /> Во всём виноваты дураки. <br /> Клянём её на переменах, <br /> Но всё-равно никуда не уедем. <br /> <br /> И вроде бы, да как бы у нас почти демократия, <br /> Но получается как всегда. <br /> Я как старушка бормочу только об одном, <br /> Что не всё так плохо пойму потом. <br /> <br /> Не всё так плохо, потому что любим и малую Родину. <br /> Потому что только здесь спокойна душа. <br /> Спасибо ей, что знаем друг друга - <br /> Рыцарей безнравственного круга. <br /> <br /> Если давно здесь не был, тянет вернуться. <br /> Тянет снова увидеть лица, на которые тошно смотреть. <br /> Создаётся ощущение, что я их не смогу забыть. <br /> А я не против чтобы так жить. <br /> <br /> Соседям на зло у нас всё в порядке. <br /> И можно сказать что уже не хреново. <br /> Пускай раньше и небо было голубее и трава зеленее, <br /> Но всё движется к давно намеченной цели. <br /> <br /> Пускай все лезут в наш монастырь с чужим уставом <br /> И покушаются на бюджет. <br /> Вытерпим, хотя вокруг никто не терпит. <br /> Вылюбим, хотя вокруг никто не любит. <br /> <br /> Пускай все лезут в наш монастырь с чужим уставом <br /> И покушаются на бюджет. <br /> Вытерпим, хотя вокруг никто не терпит. <br /> Вылюбим, хотя вокруг никто искренне не любит...</p>
				<p>осень 2009</p>

				<p>Моё настроение блюз</p>
				<p>Моё настроение блюз. <br />Моё настроение блюз. <br />Спасибо Наталье за этот плакат, <br />Спасибо за то, что был всему рад. <br />Я не был женат и я не был распят. <br />И да простит меня чей-то там муж... <br />Моё настроение блюз. <br /><br /></p>
				<p>конец 2009</p>

				<p>Первокурсная</p>
				<p>Сейчас Солнце встанет и сразу станет теплей, <br />А за спиной родной дом и что-то забыл из  вещей. <br />Моя ноша тяжела, зато не будет хвоста. <br />Мы проведём предстоящую ночь за игрой в дурака. <br /><br />Таких как я миллионы - не находят нужную дверь; <br />Сначала обычный романтик, но теперь каждый из них это зверь. <br />Убийство режима как всегда превратилось в режим. <br />Мы выстроим свой, если нам хватит сил.</p>
				<p>1.10.2010</p>

				<p>Саше Суханову</p>
				<p>Пока, Саша, давай, <br />Передавай привет рельсам. <br />Поезжай, пока нас не убило молчанье новых могил. <br />Осталось всего-ничего -  <br />Написать пару песен: <br />О счастливом несчастье и страстной любви...</p>
				<p>10.11.2010</p>

				<p>Ностальгическая мелочь</p>
				<p>Мы зачехлим гитары,<br />Мы выйдем из запоя,<br />А то, что с нами станет,<br />Мы назовём судьбою.</p>
				<p>4.3.2011</p>

				<p>Андрею Сафонову</p>
				<p>Нам по девятнадцать лет, но мы уже не те. <br />А помнишь ходили зимой без шапки, купались в вине <br />И как катались на трамвайной колбасе. <br />Не глядели назад, не думали о завтрашнем дне. <br />Жили безумно, словно во сне... <br /><br />Да какое пиво, сегодня работа, завтра учёба, послезавтра ещё что-то - <br />Вот и видимся с тобой два раза в полгода.</p>
				<p>25.3.2011</p>

				<p>Почтидвадцатиколёсный велосипед</p>
				<p>И дороги не дороги <br />и козлы не пороги, <br />Либо я стал силён, <br />либо прожил слишком много. <br />Слишком долго - <br />дольше, чем мне Бог отмерил. <br />Я сжег все мосты, закрыл все двери. <br />Не верю себе, чужим словам не верю. <br />Облокотился на воздух - думал буду смелее, <br />Умнее или на крайняк быстрее. <br />Надеялся на чудо чрезмерно долгое время, <br />Но оказался слабым чудаком в зацикленной империи. <br />Так и почти живу почти без цели <br />В почти двадцатиколёсном велосипеде.</p>
				<p>16.5.2011</p>

				<p>20.9.2011</p>
				<p>И жизнь уйдёт, как будто проходила мимо. <br />Сквозь тень людей и тусклый свет лампад.</p>
				<p>1:23</p>

				<p>КХ (подругам)</p>
				<p>Только не спрашивай как всегда.</p>
				<p>Про меня лучше помолчим.</p>
				<p>Давай расскажи как твои дела,</p>
				<p>Про мои забудем по пути.</p>
				<p>30.10.2011</p>

				<p>Кеды</p>
				<p>Я очень давно ни в кого ни влюблялся,<br />Кеды ранней весной не носил.<br />И ещё дольше не удивлялся<br />Как многообразен сей мир.<br />От светлых волос появляюсь всё чаще<br />На ваших страничках в социальных сетях<br />От писем к улыбкам, всё дальше и дальше<br />И больше свечусь в новостях.<br />Ах, знали бы вы, как люблю я ненастье - <br />Внести суматоху в свой внутренний мир:<br />И сердце забилось, и было за счастье<br />Что кеды в конец износил.</p>
				<p>Март 2012</p>

				<p>Стрелка</p>
				<p>2.4.2012</p>
				<p>Тане И. и сестре<br /><br />Стрелка пошла на колготках<br />Белое платье так броско<br />Сотый день улыбаюсь без толку<br />Слёзы - подушка мокра<br /><br />На кухне горит камфорка<br />Варится кофе в зёрнах<br />Терпенье проткнули иголкой<br />Почему до чт так долго<br /><br />Проводи же меня до дома<br />С каблуками свалиться просто<br />Для тебя они тем длиннее<br />Чем глупее твоя робость<br /><br />Стрелка пошла на колготках<br />Белое платье так броско<br />Сотый день улыбаюсь без толку<br />Слёзы - подушка мокра</p>

				<p>Весенние мелочи</p>
				<p>весна 2012</p>
				<p>Почему иногда так одиночества хочется<br />И стихи в голову лезут странные - не рифмуются<br />9.4.2012<br /><br />Перечитывая старые сообщения в блоге<br />Снова испытываешь те же ощущения;<br />Возвращая свою жизнь на исходную<br />Подвергаешь былые поступки сомнению.<br />1.5.2012</p>

				<p>Ты на два года меня старше, а, значит, лет на шесть мудрей</p>
				<p>23.7.2012</p>
				<p>Юле Н.<br /><br />Я до сих пор не знаю толком, что было между вами пару лет назад,<br />Иголки или не иголки внесли той осенью разлад.<br />Ни слова вокруг вас не прозвучало: кто виноват, что делать, как же так?<br />Все молча поняли и вы молчали, не изнасилуя на людях этот факт.<br /><br />Ты мне напоминала Саммер из “Пятьсот дней лета”:<br />Всё та же дурость, когда рядышком любимый человек.<br />Всегда плевав на важность и снобизм момента - <br />Момент пройдёт, а впереди-то целый век!<br /><br />А век прошёл гораздо раньше, чем столетье,<br />Оставив атеизм в движеньях, взгляде и мировоззренье.<br />Где вера в чувства, в те основы, звенья?<br />Что помогали Жить сквозь колкости, ухмылки, тернии.<br /><br />Не лучше ли забыть подальше, кто не позволил стать сильней!<br />Пусть жизнь это теперь лишь слово, а не бессонность тех ночей.<br />Тебе было тогда виднее, тебе же и сейчас видней<br />Ты на два года меня старше, а, значит, лет на шесть мудрей.<br /><br />10:49</p>

				<p>Привет Хемингуэю</p>
				<p>осень 2011</p>
				<p>Блокнот открылся на случайной странице, а на ней забытое четверостишье:<br /><br />Не петь о том, как плохо, когда всё хорошо.<br />В обратную сторону я тоже не умею.<br />Сегодня вечером придётся передать<br />Привет Хемингуэю.</p>

				<p>Илюша</p>
				<p>19.11.2012</p>
				<p>Илюша, знаешь, я тут подумал, кто мы в этом мире с тобой?<br />Не копаем окопов, не поём серенад, не спасаем людей, словно Ной.<br />Попили, попели, потрахались вдоволь, нет ничего нового в рамках нужды.<br />Большинство ярких слов теперь лишь о прошлом. Наше будущее - частица “бы”.<br />Клетка двадцать лет не элемент пространства, она в наших с тобой головах.<br />В словах “бизнес” и “надо”, в резюме и подъёмах к семи утра<br /> (хорошо посидели, прости, но мне на работу завтра с утра).<br />Есть ощущение, что мы уже годы делаем что-то не так.<br />Не так, как хотели, не то, о чём пели, не так, как мечтали, не так.<br />Мне по-прежнему сложно придумывать рифмы, мы всё ещё тут, а не где-нибудь в Питере.<br />Мы недавно в офис к тебе заходили, чтоб со скуки совсем не прозяб.<br />А я астроном, ну в общем учёный, нет, блядь, я - учёный, представь?!<br />Или это конец наших подростков, когда нужно кормить не только себя?<br />Когда её посредь ночи увозят на скорой, нельзя грустить у окна.<br />Охладели, поставили стенки, знаем - их больше не расшатать.<br />Остаётся бить прутья, пить дряные таблетки и без граниченья орать.<br /> 02:46</p>

				<p>Мне всегда не хватало безумства</p>
				<p>7.2.2013</p>
				<p>Мне всегда не хватало безумства,<br />А тебе головы не плечах.<br />Лепим друг друга без устали,<br />Наши слабости - наша печать.<br /><br />Наша печаль - непонимание,<br />Что понимание это в итоге:<br />Складывая параллельно ноги<br />Под одеялом приходить в раскаяние.<br /><br />Наше раскаяние словно прозренье.<br />Как иногда, говоря к Заратустре,<br />Мы ненароком волнуем искусство<br />И оставляем что-то будущим детям.<br /><br />2:35</p>

				<p>Хочу запустить схематичку</p>
				<p>27.3.2013</p>
				<p>Хочу, чтобы меня ущипнули,</p>
				<p>Крылья к рукам присобачили.</p>
				<p>Атавизмы отрезали,</p>
				<p>Круг изменить обозначенный.</p>
				<br />
				<p>Интернет сломался пополам</p>
				<p>Вместе с его телефоном,</p>
				<p>Чтобы свежекупленные обновки</p>
				<p>Сами собой порвались на кусочки.</p>
				<br />
				<p>Пятиминутка ненависти к своей безыдейности</p>
				<p>И безуспешности на третьем десятке</p>
				<p>Говорит о желании безовощности</p>
				<p>В моей продуктовой палатке.</p>
				<p>15:28</p>

				<p>Илюша сдал ТФКП</p>
				<p>зима-весна 2013</p>
				<p> </p>
				<p>Конста и сотни других авторов</p>
				<p> </p>
				<p>Трамваи в пробках не стоят,</p>
				<p>Обломов не ругает власть,</p>
				<p>Том Йорк наведался в Россию,</p>
				<p>По жизни всё как я хочу.</p>
				<p> </p>
				<p>ВКонтакте нет цитат ванильных,</p>
				<p>Всё верно Чуров посчитал,</p>
				<p>Диплом помог найти работу,</p>
				<p>Физру без “энки” прогулял.</p>
				<p> </p>
				<p><em>У-у-у, Илюша сдал ТФКП.</em></p>
				<p> </p>
				<p>По телевизору не врут,</p>
				<p>“Ягуар” только машины</p>
				<p>И “Жигули” быстрее всех,</p>
				<p>Нью-Васюки столица мира.</p>
				<p> </p>
				<p>Цензуры в интернете нету,</p>
				<p>В Ашане нет очередей.</p>
				<p>Проезд по сорок пять копеек,</p>
				<p>Зарплата в сорок тыщ рублей.</p>
				<p> </p>
				<p><em>У-у-у, Илюша сдал ТФКП.</em></p>
				<p> </p>
				<p>А что если б было всё наоборот -</p>
				<p>Козлов не принял этот сраный зачёт,</p>
				<p>Пятыгин не получал стипухи,</p>
				<p>Это, как известно, сильнее муки.</p>
				<p> </p>
				<p>Как нам тогда поверить в чудеса?</p>
				<p>Если бы баллов не хватило мальца.</p>
				<p>Быть или не быть, если бы не,</p>
				<p>Илюша не сдал ТФКП?</p>
				<p> </p>
				<p>но...</p>
				<p><em>У-у-у, Илюша сдал ТФКП.</em></p>
				<p> </p>

				<p>Жизнь продолжается</p>
				<p>09.06.2013</p>
				<p>Ты рос без отца</p>
				<p>Жизнь продолжается</p>
				<p>В тебе нет яйца</p>
				<p>Жизнь продолжается</p>
				<p>Жизнь продолжается</p>
				<p><br /></p>
				<p>Пятый день не танцуется</p>
				<p>Жизнь продолжается</p>
				<p>И разбитые блюдца</p>
				<p>Жизнь продолжается</p>
				<p>Жизнь продолжается</p>
				<p><br /></p>
				<p>Нечего хмуриться</p>
				<p>Жизнь продолжается</p>
				<p>Стоит обуться</p>
				<p>Жизнь продолжается</p>
				<p>Жизнь продолжается</p>
				<p><br /></p>
				<p>Только без пропойца</p>
				<p>Жизнь продолжается</p>
				<p>Рекою Хортица</p>
				<p>Жизнь продолжается</p>
				<p>Жизнь продолжается</p>
				<p><br /> <br /></p>
				<p>Сердце не бьётся</p>
				<p>Но жизнь продолжается</p>
				<p>Хочется Солнца</p>
				<p>Жизнь продолжается</p>
				<p>Жизнь продолжается</p>
				<p> </p>

				<p>Ни-о-чёмная</p>
				<p>29.05.2013</p>
				<p> </p>
				<p>Возрастающая луна</p>
				<p>Подготовила почву для</p>
				<p>И отправила почту на</p>
				<p>Берега Казахстана</p>
				<p> </p>
				<p>Привет-привет</p>
				<p>Мы не виделись с тобою столько лет</p>
				<p>И банальные рифмы</p>
				<p>Не расширяют зрачки нам бо-о-ольше, нет</p>
				<p> </p>
				<p>Привет-привет</p>
				<p>Мы не виделись с тобою столько лет</p>
				<p>И ни-о-чёмные песни</p>
				<p>Не вызывают раздраженья бо-о-ольше, нет</p>
				<p> </p>
				<p>Мы догоним её в пути</p>
				<p>Колыбель свою не найти</p>
				<p>Постараемся там</p>
				<p>Чтобы не за чем нам</p>
				<p>Было обратно</p>
				<p> </p>
				<p>Привет-привет</p>
				<p>Мы не виделись с тобою столько лет</p>
				<p>И банальные рифмы</p>
				<p>Не расширяют зрачки нам бо-о-ольше, нет</p>
				<p> </p>
				<p>Привет-привет</p>
				<p>Мы не виделись с тобою столько лет</p>
				<p>И ни-о-чёмные песни</p>
				<p>Не вызывают раздраженья бо-о-ольше, нет</p>
				<p><br /></p>

				<p>Илюша (II)</p>
				<p>Илюша, я так много лет не писал стихов,</p>
				<p>Сколько работаю в еба́ной айтишке.</p>
				<p>А мы с тобой — тогда безусые мальчишки —</p>
				<p>Теперь лишь изредка читаем книжки,</p>
				<p>И больше всё похожи на скуфов.</p>

				<p>Lean, impact, признанье, эполеты?</p>
				<p>Не будь наивным, иксели да бюджеты.</p>
				<p>Cut-edge technology? Мой друг, камон, политика да склоки</p>
				<p>И семь часов подряд светить ебалом в Толке.</p>

				<p>Так папа умер, ГЭРБ, burnout, тик, «а может разогнаться прямо в стену?»,</p>
				<p>EMDR, бессонница, ретрит, «закончится когда-нибудь ли это?</p>
				<p>Пока спасал вот отдых в городе Серове».</p>
				<p>Твой друг задумался: что будет ещё кроме?</p>
				<p>И может нахуй эту «пенсию в Газпроме»?</p>

				<p>Рельсы ломать страшно, тревожно, стыдно, больно. Столь многое оставить позади:</p>
				<p>И *дитер смэш* и нажитое честным и ты и ты и ты и ты и ты.</p>

				<p>А может ну его и зубы сжать, опять пропить мелатонинки?</p>
				<p>Мы жизнь всегда успеем поломать, нам не нужны для этого ачивки.</p>
				<p>Илюх, кароч, я собсно чё хотел сказать: пошли в «Мелодии» пропустим по наливке?</p>

				<p>18 октября 2024, 02:35</p>
			</div>
		</div>
	);
}
